Catalogs/ВидыЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ВидыЗаказовПокупателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеДоставлен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОтгружен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОжидаетОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СостоянияЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СостоянияЗаказовПокупателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьРеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьСтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СостоянияЗаказНарядов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СостоянияЗаказНарядов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РаботаСВидамиЗаказов/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ФормаЭлементаВидаЗаказаПриСозданииНаСервере(Форма) Экспорт 
	
	Объект     = Форма.Объект; 
	ЭтотОбъект = Форма.ЭтотОбъект; 
	Элементы   = Форма.Элементы;
	
	СостояниеЗавершен = СостояниеЗавершенИзВидаЗаказа(Объект.Ссылка);
	ОтборСтрок = Новый Структура("Состояние", СостояниеЗавершен);
	
	СтрокаСостояниеЗавершен = Объект.ПорядокСостояний.НайтиСтроки(ОтборСтрок);
	ТаблицаСостояний = Объект.ПорядокСостояний;

	Если НЕ СтрокаСостояниеЗавершен.Количество() Тогда			
		
		НоваяСтрока = ТаблицаСостояний.Добавить();
		НоваяСтрока.Состояние = СостояниеЗавершен;
		НоваяСтрока.НаименованиеСостояния = СостояниеЗавершен.Наименование;
		НоваяСтрока.ЦветТекста = СостояниеЗавершен.Цвет.Получить();
		НоваяСтрока.ЦветФона = СостояниеЗавершен.ЦветФона.Получить();
		
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокСостояний.Ссылка КАК Ссылка,
	|	ПорядокСостояний.НомерСтроки КАК НомерСтроки,
	|	ПорядокСостояний.Состояние КАК Состояние,
	|	СостоянияЗаказовПокупателей.ПометкаУдаления КАК ПометкаУдаления,
	|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
	|	СостоянияЗаказовПокупателей.Цвет КАК Цвет,
	|	СостоянияЗаказовПокупателей.ЦветФона КАК ЦветФона,
	|	СостоянияЗаказовПокупателей.Предопределенный КАК Предопределенный,
	|	СостоянияЗаказовПокупателей.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ПорядокСостояний
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
	|		ПО ПорядокСостояний.Состояние = СостоянияЗаказовПокупателей.Ссылка
	|ГДЕ ПорядокСостояний.Ссылка = &ВидЗаказа";
	
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ВидыЗаказНарядов") Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВидыЗаказовПокупателей", "ВидыЗаказНарядов");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СостоянияЗаказовПокупателей", "СостоянияЗаказНарядов");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидЗаказа", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Состояние Из Результат Цикл
		СостояниеВТаблице = ТаблицаСостояний.НайтиСтроки(Новый Структура("Состояние", Состояние.Состояние));
		Для Каждого НайденноеСостояние Из СостояниеВТаблице Цикл
			Если Состояние.Цвет.Получить() <> Неопределено Тогда
				НайденноеСостояние.ЦветТекста = Состояние.Цвет.Получить();
			КонецЕсли;
			Если Состояние.ЦветФона.Получить() <> Неопределено Тогда
				НайденноеСостояние.ЦветФона = Состояние.ЦветФона.Получить();
			КонецЕсли;
			НайденноеСостояние.ПометкаУдаления = Состояние.ПометкаУдаления;
			НайденноеСостояние.НаименованиеСостояния = Состояние.Наименование;
		КонецЦикла;
	КонецЦикла;
	
	НесколькоВидовЗаказов = ПолучитьФункциональнуюОпцию("Использовать" + Объект.Ссылка.Метаданные().Имя); 
	
	Если НЕ НесколькоВидовЗаказов Тогда
		
		ЭтотОбъект.АвтоЗаголовок = Ложь;  
		
		Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ВидыЗаказовПокупателей") Тогда
			ЗаголовокФормы = НСтр("ru  = 'Состояния заказов покупателей'");
		Иначе
			ЗаголовокФормы = НСтр("ru  = 'Состояния заказ-нарядов'");
		КонецЕсли;
		ЭтотОбъект.Заголовок = ЗаголовокФормы;
		
		Элементы.Наименование.Видимость = Ложь;
		Элементы.Комментарий.Видимость = Ложь; 
		Элементы.ПорядокСостоянийДобавитьВсе.Видимость = Ложь;
		
		Элементы.ПорядокСостоянийКонтекстноеМенюУдалить.Видимость = Ложь;
		Элементы.ПорядокСостоянийУдалить.Видимость = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция СостояниеЗавершенИзВидаЗаказа(ВидЗаказа) Экспорт 

	Если ТипЗнч(ВидЗаказа) = Тип("СправочникСсылка.ВидыЗаказовПокупателей") Тогда
	
		СостояниеЗавершен = Справочники.СостоянияЗаказовПокупателей.Завершен;	
	
	ИначеЕсли ТипЗнч(ВидЗаказа) = Тип("СправочникСсылка.ВидыЗаказНарядов") Тогда
		
		СостояниеЗавершен = Справочники.СостоянияЗаказНарядов.Завершен;
	
	КонецЕсли;
	
	Возврат СостояниеЗавершен;

КонецФункции

#КонецОбласти
